-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-12-28 09:41:32
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `ppe`
--

-- --------------------------------------------------------

--
-- 資料表結構 `_cata`
--

CREATE TABLE `_cata` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'ai',
  `cate_no` varchar(10) NOT NULL COMMENT '分類代號',
  `SN` varchar(10) NOT NULL COMMENT '編號',
  `pname` varchar(255) NOT NULL COMMENT '品名',
  `PIC` varchar(255) NOT NULL COMMENT '圖片',
  `cata_remark` varchar(255) NOT NULL COMMENT '敘述',
  `OBM` varchar(255) NOT NULL COMMENT '品牌/製造商',
  `model` varchar(20) NOT NULL COMMENT '型號',
  `size` varchar(20) NOT NULL COMMENT '尺寸範圍',
  `unit` varchar(5) NOT NULL COMMENT '單位',
  `SPEC` text NOT NULL COMMENT '規格',
  `part_no` varchar(20) NOT NULL COMMENT '料號',
  `scomp_no` longtext NOT NULL COMMENT '供應商',
  `buy_a` text NOT NULL COMMENT '安量倍數A',
  `buy_b` text NOT NULL COMMENT '安量倍數B',
  `flag` varchar(3) NOT NULL COMMENT '開關',
  `updated_at` datetime NOT NULL COMMENT '更新日期時間',
  `created_at` datetime NOT NULL COMMENT '建檔日期時間',
  `updated_user` varchar(10) NOT NULL COMMENT '建檔人員'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `_cata`
--

INSERT INTO `_cata` (`id`, `cate_no`, `SN`, `pname`, `PIC`, `cata_remark`, `OBM`, `model`, `size`, `unit`, `SPEC`, `part_no`, `scomp_no`, `buy_a`, `buy_b`, `flag`, `updated_at`, `created_at`, `updated_user`) VALUES
(1, 'C', 'P-001-W', '通氣式工程安全帽_白', 'P-001-W.png', '白', '龍達', 'JFC-9034', '白', '頂', '1. 符合CNS1336認證。\r\n2. 顏色：白。\r\n3. 內襯為四點式，帽帶為鬆緊帶式。\r\n4. 報價含內襯與帽帶。\r\n5. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:27:00', '2023-07-05 15:02:00', '陳建良'),
(2, 'C', 'P-002-W', '工程安全帽_白', 'P-002-W.png', '白', '龍達', 'SM-901', '白', '頂', '1. 符合CNS1336認證。\r\n2. 顏色：白。\r\n3. 內襯為四點式，帽帶為鬆緊帶式。\r\n4. 報價含內襯與帽帶。\r\n5. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:00:00', '2023-07-05 15:02:00', '陳建良'),
(3, 'C', 'P-002-R', '工程安全帽_紅', 'P-002-R.png', '紅', '龍達', 'SM-901', '紅', '頂', '1. 符合CNS1336認證。\r\n2. 顏色：紅。\r\n3. 內襯為四點式，帽帶為鬆緊帶式。\r\n4. 報價含內襯與帽帶。\r\n5. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:00:00', '2023-07-05 15:02:00', '陳建良'),
(4, 'C', 'P-002-B', '工程安全帽_藍', 'P-002-B.png', '藍', '龍達', 'SM-901', '藍', '頂', '1. 符合CNS1336認證。\r\n2. 顏色：藍。\r\n3. 內襯為四點式，帽帶為鬆緊帶式。\r\n4. 報價含內襯與帽帶。\r\n5. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:01:00', '2023-07-05 15:02:00', '陳建良'),
(5, 'C', 'P-002-Y', '工程安全帽_黃', 'P-002-Y.png', '黃', '龍達', 'SM-901', '黃', '頂', '1. 符合CNS1336認證。\r\n2. 顏色：黃。\r\n3. 內襯為四點式，帽帶為鬆緊帶式。\r\n4. 報價含內襯與帽帶。\r\n5. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:01:00', '2023-07-05 15:02:00', '陳建良'),
(6, 'I', 'P-003', '工程安全帽內襯', 'P-003.png', '', '龍達', '', '', '個', '1. 內襯為四點式。\r\n2. 無塵室可使用(不發塵材質)。\r\n3. 需可配合廠內目前使用之安全帽(龍達SM-901)。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:02:00', '2023-07-05 15:02:00', '陳建良'),
(7, 'C', 'P-004-W', '無塵室輕便帽_白', 'P-004-W.png', '白', '龍達', 'SM-903', '白', '頂', '1. 耐衝擊材質製造(符合EN812認證)。\r\n2. 顏色：白。\r\n3. 需有頂部防撞帶。\r\n4. 內襯前後端凸緣需平緩(如照片所示)。\r\n5. 與內襯結合方式為壓扣式(如照片所示)。\r\n6. 帽帶為鬆緊帶式。\r\n7. 報價含內襯與帽帶。\r\n8. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:01:00', '2023-07-05 15:02:00', '陳建良'),
(8, 'C', 'P-004-R', '無塵室輕便帽_紅', 'P-004-R.png', '紅', '龍達', 'SM-903', '紅', '頂', '1. 耐衝擊材質製造(符合EN812認證)。\r\n2. 顏色：紅。\r\n3. 需有頂部防撞帶。\r\n4. 內襯前後端凸緣需平緩(如照片所示)。\r\n5. 與內襯結合方式為壓扣式(如照片所示)。\r\n6. 帽帶為鬆緊帶式。\r\n7. 報價含內襯與帽帶。\r\n8. 出貨含內襯與帽帶。', '', '10019391,馬吉謙', '1.1', '1.5', 'On', '2023-07-11 13:15:00', '2023-07-05 15:02:00', '陳建良'),
(9, 'C', 'P-004-B', '無塵室輕便帽_藍', 'P-004-B.png', '藍', '龍達', 'SM-903', '藍', '頂', '1. 耐衝擊材質製造(符合EN812認證)。\r\n2. 顏色：藍。\r\n3. 需有頂部防撞帶。\r\n4. 內襯前後端凸緣需平緩(如照片所示)。\r\n5. 與內襯結合方式為壓扣式(如照片所示)。\r\n6. 帽帶為鬆緊帶式。\r\n7. 報價含內襯與帽帶。\r\n8. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:02:00', '2023-07-05 15:02:00', '陳建良'),
(10, 'C', 'P-004-Y', '無塵室輕便帽_黃', 'P-004-Y.png', '黃', '龍達', 'SM-903', '黃', '頂', '1. 耐衝擊材質製造(符合EN812認證)。\r\n2. 顏色：黃。\r\n3. 需有頂部防撞帶。\r\n4. 內襯前後端凸緣需平緩(如照片所示)。\r\n5. 與內襯結合方式為壓扣式(如照片所示)。\r\n6. 帽帶為鬆緊帶式。\r\n7. 報價含內襯與帽帶。\r\n8. 出貨含內襯與帽帶。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:02:00', '2023-07-05 15:02:00', '陳建良'),
(11, 'I', 'P-005', '無塵室輕便帽內襯', 'P-005.png', '', '不指定', '', '', '個', '1. 需有頂部防撞帶。\r\n2. 無塵室可使用(不發塵材質)。\r\n3. 內襯前後端凸緣需平緩(如照片所示)。\r\n4. 與帽殼結合方式為壓扣式(如照片所示)。\r\n5. 需可配合廠內目前使用之輕便帽(龍達SM-903)。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:02:00', '2023-07-05 15:02:00', '陳建良'),
(12, 'I', 'P-006', '安全帽帽帶', 'P-006.png', '', '不指定', '', '', '個', '1. 鬆緊帶式。\r\n2. 無塵室可使用(不發塵材質)。\r\n3. 需可配合廠內目前使用之工程安全帽(龍達SM-901與龍達SM-903)與無塵室輕便帽。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:02:00', '2023-07-05 15:02:00', '陳建良'),
(13, 'I', 'P-007', '防化學品面擋架', 'P-007.png', '', '不指定', '', '', '個', '1. 框架需為非金屬材料。\r\n2. 需可配合廠內目前使用之面檔與安全帽(龍達SM-901)。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:53:00', '2023-07-05 15:02:00', '陳建良'),
(14, 'E', 'P-008', '防護頭盔', 'P-008.png', '', '', '', '', '個', '1. PP材質\r\n2. 符合ANSI Z87認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 16:53:00', '2023-07-05 15:02:00', '陳建良'),
(15, 'I', 'P-009', 'PC安全防護片', 'P-009.png', '', '不指定', '', '', '個', '1. 透明PC面罩\n2. 符合ANSI Z87+認證。\n3. 長：39cm、寬：20cm、厚：0.1cm\n4.需可配合廠內目前使用之頭盔。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(16, 'E', 'P-010', '防UV眼鏡', 'P-010.png', '', 'ACEST', 'CI-31', '', '個', '1. 符合EN/ANSI/CNS認證。\n2. 防UV/IR強光，紫外線波長00-500nm。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(17, 'E', 'P-011', '全罩式安全眼鏡', 'P-011.png', '', '', 'S-60', '', '個', '1. 符合CNS7177認證(或同等級國際規範)。    \n2. 鏡面具防霧功能。\n3. 需含本體與可調式鬆緊帶/鏡腳。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(18, 'E', 'P-012', '兩用式全罩式安全眼鏡', 'P-012.png', '2023年採購把17~18下成同一規格，將合併', 'MTC', '18033', '', '個', '1. 符合ANSI Z87認證(或同等級國際規範)。    \n2. 需含本體、鏡架與可調式鬆緊帶(不發塵)。', '', '', '1.1', '1.5', 'Off', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(19, 'E', 'P-013', '一般型安全眼鏡', 'P-013.png', '', '不指定', '', '', '個', '1. PC鏡片，耐基本衝擊、噴濺。\n2. 符合CE/EN/ANSI/CNS認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(20, 'A', 'P-014', '平面式活性碳口罩', 'P-014.png', '', '不指定', '', '', '個', '1. 共計四層(防潮層、活性碳層、過濾層與纖維層)，鼻樑處附鐵絲以供固定。盒裝(50個/盒)。 出廠日期半年內，且包裝需標示有效日期。\r\n2.外包裝需有CNS14756認證標示或提供相關證明。', 'R1203053ZJ50', '04908814,明江貿易', '1.1', '1.5', 'On', '2023-07-21 15:45:00', '2023-07-05 15:02:00', '陳建良'),
(21, 'A', 'P-015-AG', 'N95口罩_AG(酸性)', 'P-015-AG.png', 'AG(酸性)', '3M', '8246', '', '個', '1. 需可防酸性氣體。\r\n2. 95%以上過濾效能，NIOSH認證。\r\n3. 出廠日期一年內，且需標示有效日期。', 'R12030635E60', '', '1.1', '1.5', 'On', '2023-07-21 15:59:00', '2023-07-05 15:02:00', '陳建良'),
(22, 'A', 'P-015-OV', 'N95口罩_OV(有機)', 'P-015-OV.png', 'OV(有機)', '3M', '8247', '', '個', '1. 需可防有機氣體。\r\n2. 95%以上過濾效能，NIOSH認證。\r\n3. 出廠日期一年內，且需標示有效日期。', 'R1203073ZDC0', '', '1.1', '1.5', 'On', '2023-07-21 15:59:00', '2023-07-05 15:02:00', '陳建良'),
(23, 'A', 'P-015-D', 'N95口罩_防塵', 'P-015-D.png', '防塵', '3M', '8210', '', '個', '1. 通過NIOSH 42CFR N95等級。\r\n2. 出廠日期一年內，且需標示有效日期。', 'R12032J3HWZ0', '', '1.1', '1.5', 'On', '2023-07-21 15:59:00', '2023-07-05 15:02:00', '陳建良'),
(24, 'A', 'P-016-S', '半面式防護面具', 'P-016-S.png', '', '3M', '6200', 'S', '個', '1. 雙濾罐式。\n2. KRATON材質，可搭配3M多種濾材使用。\n3. 四點式調整頭戴，採取固定式方式穿戴。\n4. 可重複清洗使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(25, 'A', 'P-016-M', '半面式防護面具', 'P-016-M.png', '', '3M', '6200', 'M', '個', '1. 雙濾罐式。\n2. KRATON材質，可搭配3M多種濾材使用。\n3. 四點式調整頭戴，採取固定式方式穿戴。\n4. 可重複清洗使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(26, 'A', 'P-016-L', '半面式防護面具', 'P-016-L.png', '', '3M', '6200', 'L', '個', '1. 雙濾罐式。\r\n2. KRATON材質，可搭配3M多種濾材使用。\r\n3. 四點式調整頭戴，採取固定式方式穿戴。\r\n4. 可重複清洗使用。', '', '', '1.1', '1.5', 'On', '2023-07-11 13:26:00', '2023-07-05 15:02:00', '陳建良'),
(27, 'A', 'P-017', '全面式防護面具', 'P-017.png', '', '3M', '6800', '', '個', '1. 雙濾罐式。\n2. 矽膠/熱塑性材質，可搭配多種濾材使用。\n3. 各項零配件可個別替換維修\n4. 鏡面符合美國ANSI Z87.1-2010標準，耐高速衝擊(Z87+)\n5.可重複清洗使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(28, 'I', 'P-018-A', '綜合性濾毒罐', 'P-018-A.png', '', '3M', '6003', '', '個', '1. 符合NIOSH認證或同等級。\n2. 可配合3M面具使用。\n3. 2個/組。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(29, 'I', 'P-018-B', '汞蒸氣/氯氣用濾毒罐', 'P-018-B.png', '', '3M', '6009', '', '個', '1. 符合NIOSH認證或同等級。\n2. 可配合3M面具使用。\n3. 2個/組。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(30, 'I', 'P-019-A', 'P100過濾棉片', 'P-019-A.png', '', '3M', '2091', '', '個', '1. 美國NIOSE P100等級，對粉塵過濾效率達99.97%以上。\n2. 可配合3M面具使用。\n3. 2片/組。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(31, 'I', 'P-019-B', 'N95過濾棉片', 'P-019-B.png', '', '3M', '5N11', '', '個', '1. 美國NIOSE N95等級，對粉塵過濾效率達95%以上。\n2. 需可搭配3M 501濾蓋使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(32, 'I', 'P-019-C', '濾棉蓋', 'P-019-C.png', '', '3M', '501', '', '個', 'N95過濾棉片(3M-5N11)專用濾棉蓋。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(33, 'I', 'P-020-A', 'PAPR P3等級濾罐', 'P-020-A.png', '', 'Clean AIR', '500048', '', '個', '1. EN認證P3等級濾罐。\n2. 防一般粉塵。\n3. 需可與本廠PAPR(Clean AIR)搭配使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(34, 'I', 'P-024-B', 'PAPR 綜合型濾毒罐_不含Hg', 'P-024-B.png', '不含Hg', 'Clean AIR', '500168', '', '個', '1. 防有機、無機與酸性氣體、蒸氣與氨氣。\n2. 防有害固態與液態微粒。\n3. 需可與本廠PAPR(Clean AIR)搭配使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(35, 'A', 'P-025', '正壓電動過濾式呼吸器', 'P-025.png', 'PAPR', 'Clean AIR', '510000FCA', '', '台', '1. 全套包含：主機、充電器及電池1個。\r\n2. 送氣?：160 L/min以上。\r\n3. 符合EN 12941及NIOSH標準。\r\n4. 主機本體防水，?需保護套可直接沖洗。\r\n5. 主機可隨?芯阻抗自動調整轉?，保持空氣???變。\r\n6. 電?指示器/?芯阻抗指示器、風速?常/電?過低蜂鳴器警報。', '', '', '1.1', '1.5', 'On', '2023-07-12 12:55:00', '2023-07-05 15:02:00', '陳建良'),
(36, 'I', 'P-025-A', '正壓電動過濾式呼吸器電池', 'P-025-A.png', '', 'Clean AIR', '510010', '', '個', '1. 需可與本廠PAPR(Clean AIR_PAPR_510000FCA) 搭配使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(37, 'I', 'P-025-B', 'PAPR_耐久型頭套', 'P-025-B.png', '', 'Clean AIR', '720202B', '', '個', '1. 頭套材質為可抗化尼龍具PU覆膜材質。\n2. EN認證，並需有可調式頸帶及傳聲膜片。\n3. 需可與本廠PAPR(Clean AIR_PAPR_510000FCA) 搭配使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(38, 'I', 'P-025-C', 'PAPR_頭套送氣管', 'P-025-C.png', '', 'Clean AIR', '710060', '', '個', '1. EN認證。\n2. 需可與上述頭套/面具搭配使用在本廠PAPR (Clean AIR_PAPR_510000FCA)上。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(39, 'I', 'P-026-A', '供氣式_轉接頭  (3M_ADP-03)', 'P-026-A.png', '3M_ADP-03', '3M', 'ADP-03', '', '個', '1.可相接3M呼吸管與SCOTT 正壓電動過?式呼吸器', '', '', '1.1', '1.5', 'On', '2023-07-06 17:00:00', '2023-07-05 15:02:00', '陳建良'),
(40, 'I', 'P-026-B', '供氣式_高階內襯  (3M_S-950)', 'P-026-B.png', '3M_S-950', '3M', 'S-950', '', '個', '1.內襯與S-605、S-807頭罩搭配使用', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(41, 'I', 'P-026-C', '供氣式_頭罩 (3M_S-605)', 'P-026-C.png', '3M_S-605', '3M', 'S-605', '', '個', '1.頭罩與S-950內襯搭配使用', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(42, 'I', 'P-026-D', '3M_供氣式_耐用型呼吸管', 'P-026-D.png', '', '3M', 'BT-40', '', '條', '1. 可與3M S-950高階內襯及3M Versaflo系列動力式呼吸防護具主機搭配使用。\n2. 合成橡膠材質，高耐用度，適用於高溫或較嚴峻的工作環境。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(43, 'G', 'P-027', '長效性耳塞', 'P-027.png', '', '3M', '1271', '', '組', '1. NRR值24dB。\n2. 帶線(附盒子)。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(44, 'G', 'P-072', '輕便性耳塞', 'P-072.png', '', '3M', '1100', '', '個', '1. NRR值29dB。\n2. 橘色子彈型。', '', '', '1.1', '1.5', 'On', '0000-00-00 00:00:00', '0000-00-00 00:00:00', ''),
(45, 'G', 'P-028', '頭掛式耳罩', 'P-028.png', '', '3M', 'H10A', '', '個', '1. 適用在噪音值低於105分貝的場所。\n2. NRR值30dB\n3. 可更換耳罩內吸音材質。\n4. 不鏽鋼材質頭帶\n5. 配戴於頸後位置，方便與安全帽同時使用。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(46, 'G', 'P-029', '頸掛式防音耳罩', 'P-029.png', '', '3M', 'AO-H10B', '', '個', '1. 採彈性鋼架連接，可搭配任何安全帽。\n2. NRR值29dB。\n3.適用於噪音值低於105分貝的場所 \n4.符合ANZI 或CE標準認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(47, 'G', 'P-030', '加掛於安全帽之耳罩', 'P-030.png', '', '不指定', '', '', '個', '1. 需可與本廠安全帽(龍達SM-901)搭配使用，並附連結套件。\n2. NRR > 25 dB 或 SNR > 28 dB以上。\n3. 符合ANZI或CE標準認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(48, 'D', 'P-031-S', '薄型防切割手套', 'P-031-S.png', '', '不指定', '', 'S', '雙', '1. 符合CE認證，4344等級以上(認證須標示於手套上)\n2. 材質：單面NBR塗層', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(49, 'D', 'P-031-M', '薄型防切割手套', 'P-031-M.png', '', '不指定', '', 'M', '雙', '1. 符合CE認證，4344等級以上(認證須標示於手套上)\n2. 材質：單面NBR塗層', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(50, 'D', 'P-031-L', '薄型防切割手套', 'P-031-L.png', '', '不指定', '', 'L', '雙', '1. 符合CE認證，4344等級以上(認證須標示於手套上)\n2. 材質：單面NBR塗層', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(51, 'D', 'P-031-XL', '薄型防切割手套', 'P-031-XL.png', '', '不指定', '', 'XL', '雙', '1. 符合CE認證，4344等級以上(認證須標示於手套上)\n2. 材質：單面NBR塗層', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(52, 'D', 'P-032-S', '一般防切割手套', 'P-032-S.png', '', '不指定', '', 'S', '雙', '檢測通過EN388-4544之物理性能標準', '', '', '1.1', '1.5', 'Off', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(53, 'D', 'P-032-M', '一般防切割手套', 'P-032-M.png', '', '不指定', '', 'M', '雙', '檢測通過EN388-4544之物理性能標準', '', '', '1.1', '1.5', 'Off', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(54, 'D', 'P-032-L', '一般防切割手套', 'P-032-L.png', '', '不指定', '', 'L', '雙', '檢測通過EN388-4544之物理性能標準', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(55, 'D', 'P-032-XL', '一般防切割手套', 'P-032-XL.png', '', '不指定', '', 'XL', '雙', '檢測通過EN388-4544之物理性能標準', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(56, 'D', 'P-032-2XL', '一般防切割手套', 'P-032-2XL.png', '', '不指定', '', '2XL', '雙', '檢測通過EN388-4544之物理性能標準', '', '', '1.1', '1.5', 'Off', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(57, 'D', 'P-033', '防切割手套 ', 'P-033.png', '', '百潤', '', '單一\n尺寸', '雙', '符合CE認證，EN388-4344', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(58, 'D', 'P-34-8', '防切割手套 (MAPA-586)', 'P-034-8.png', 'MAPA-586', 'MAPA', '586', '8', '雙', '1. 尺寸：長24-30cm。\n2. 符合CE認證(4X43D)\n3.材質：HDPE，單面PU塗層', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(59, 'D', 'P-34-9', '防切割手套 (MAPA-586)', 'P-034-9.png', 'MAPA-586', 'MAPA', '586', '9', '雙', '1. 尺寸：長24-30cm。\n2. 符合CE認證(4X43D)\n3.材質：HDPE，單面PU塗層', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(60, 'D', 'P-34-10', '防切割手套 (MAPA-586)', 'P-034-10.png', 'MAPA-586', 'MAPA', '586', '10', '雙', '1. 尺寸：長24-30cm。\n2. 符合CE認證(4X43D)\n3.材質：HDPE，單面PU塗層', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(61, 'D', 'P-35', '防穿刺手套\n (HexArmor SharpsMaster II 9014 )', 'P-035.png', 'HexArmor SharpsMaster II 9014', 'HexArmor', 'GHA-SIX-9014', '單一\n尺寸', '雙', '1. SuperFabric? brand材質。\n2. 提供最高防針刺防護25號針(ASTM 1342-05測試)。\n3. 符合CE與EN388認證：4544之物理性能標準。', '', '', '1.1', '1.5', 'Off', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(62, 'D', 'P-036', '防切割袖套', 'P-036.png', '', 'MAPA', '', '單一\n尺寸', '雙', '1.材質：HDPE\n2.尺寸：長60cm\n3.CE認證(4X4XD)', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(63, 'D', 'P-037', '皮手套', 'P-037.png', '', '不指定', '', '單一\n尺寸', '雙', '1. 使用豬面皮製成。\n2. 長度35cm，厚度0.2 mm以上，可耐切割穿刺。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(64, 'D', 'P-038', '防熱手套_200度', 'P-038.png', '200度', 'Dailove', 'DL-200', '單一\n尺寸', '雙', '1. 外層矽膠材質(SILICONE)、內裡化學纖維材質\n2. 尺寸：長27cm、厚2.95mm\n3. 可用於 200℃(約7秒)、 150℃(約15秒)溫度之作業\n4. 具CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(65, 'D', 'P-039', '防熱手套_400度', 'P-039.png', '400度', '不指定', '', '單一\n尺寸', '雙', '1. 手心及姆指部份由杜邦防火材料對位芳香族聚毓酸纖維絲 (KEVLAR)NOR-FAB40O 被覆防輻射熱鋁箔構成，防火布向外，鋁箔向內，厚度1.5 mm。\n2. 手背及袖口亦由防火布料披覆鋁箔製成，鋁箔向外。\n3. 內襯手心及手背由3 mm厚隔熱棉製成。 \n4. 手套長度5指X14吋，手背寬145 mm，袖口寬170 mm。\n5. 以上防火系列產品全部以(KEVLAR)3/3O防火線縫製。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(66, 'D', 'P-040', '低溫作業手套', 'P-040.png', '', 'MAPA', '770', '單一\n尺寸', '雙', '1. 材質：PVC材質。\n2. 尺寸：長30cm。\n3. 耐低溫-30℃。\n4. 具CE認證。適用濃度40％ NaOH、65% 硝酸與25％  氨作業。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(67, 'I', 'P-041', '4H_防化學品手套內襯', 'P-041.png', '', '不指定', '', '單一\n尺寸', '雙', '1. 材質：PE+EV0H+PE 材質，5層淋膜\n2. 長度：40cm、厚度：0.1mm\n3. 適用多種化學物質之作業場合，使用時間可達480分鐘(具CE認證)\n4. 僅做一般化學手套的內層手套使用', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(68, 'D', 'P-042-8', '酸鹼暨溶劑作業防護手套', 'P-042-8.png', '', 'MAPA', '517', '8', '雙', '1. 長度：36cm、厚度：0.5mm\n2.Trionic(天然乳膠與Neoprene、Nitrile合成)\n3. 具CE認證。適用濃度氫氧化鈉45%、氫氟酸40%、甲醛作業。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(69, 'D', 'P-042-9', '酸鹼暨溶劑作業防護手套', 'P-042-9.png', '', 'MAPA', '517', '9', '雙', '1. 長度：36cm、厚度：0.5mm\n2.Trionic(天然乳膠與Neoprene、Nitrile合成)\n3. 具CE認證。適用濃度氫氧化鈉45%、氫氟酸40%、甲醛作業。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(70, 'D', 'P-042-10', '酸鹼暨溶劑作業防護手套', 'P-042-10.png', '', 'MAPA', '517', '10', '雙', '1. 長度：36cm、厚度：0.5mm\n2.Trionic(天然乳膠與Neoprene、Nitrile合成)\n3. 具CE認證。適用濃度氫氧化鈉45%、氫氟酸40%、甲醛作業。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(71, 'D', 'P-043', '防有機溶劑手套', 'P-043.png', '', 'MAPA', '491', '單一\n尺寸', '雙', '1.長37cm、厚0.38mm。\n2. Nitrile材質製成，手部具壓紋防滑處理，內有絨裡。\n3. 具CE認證。適用濃度甲醇、正庚烷、40％ NaOH、與96％ 硫酸作業。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(72, 'D', 'P-044', '防酸鹼手套', 'P-044.png', '', 'MAPA', '450', '單一\n尺寸', '雙', '1. 長41cm、厚0.75mm。\n2. Neoprene (氯丁橡膠)，內有絨裡，手部具壓紋防滑處理。\n3. 具CE認證。適用65％ 硝酸、99％ 乙酸、40％ 氫氟酸、與96％ 硫酸作業。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(73, 'D', 'P-045', '防化學手套', 'P-045.png', '', 'MAPA', '651', '單一\n尺寸', '雙', '1. 長35cm、厚0.5mm。\n2. Butyl(丁基橡膠)\n3. 具CE認證。適用濃度甲醇、丙酮、乙睛、醋酸乙脂、40％ NaOH、與96％ 硫酸作業。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(74, 'D', 'P-046-A', '防強酸鹼手套_36 cm', 'P-046-A.png', '', 'HANAKI', 'GCB-HK-A22', '單一\n尺寸', '雙', '1. 防王水、氫氟酸、鹽酸37%、磷酸75%、氫氧化鈉45%、酪酸50%、防氫硫酸鹽95%、重珞酸鉀、過氧化氫90%、硝酸20%+氫氟酸4%、硝酸70%\n2.美國杜邦Hypalon(有防滑絨內裡)。\n3. 長36 cm', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(75, 'D', 'P-046-B', '防強酸鹼手套_55 cm', 'P-046-B.png', '', 'HANAKI', 'GCB-HK-A55', '單一\n尺寸', '雙', '1. 防王水、氫氟酸、鹽酸37%、磷酸75%、氫氧化鈉45%、酪酸50%、防氫硫酸鹽95%、重珞酸鉀、過氧化氫90%、硝酸20%+氫氟酸4%、硝酸70%\n2.美國杜邦Hypalon(有防滑絨內裡)。\n3. 長55 cm', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(76, 'D', 'P-047', 'PVC手套_加長連袖套型', 'P-047.png', '', '', '', '單一\n尺寸', '雙', '1. 長60 cm，厚0.3 mm。\n2. 材質：手套為塑膠(PVC)。\n3. 適用HCl、HF、NaOH水溶液與2.38％  THAM作業。\n4. 檢附測試報告及5％TMAH不滲透性測試報告。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(77, 'D', 'P-048-S', '酸鹼溶劑用PVC手套', 'P-048-S.png', '', '百潤', 'GSO-ST-01', 'S', '雙', '1. 長30公分，厚0.25 mm。\n2. 塑膠(PVC)材質，指尖加厚。\n3. 適用HCl、HF、NaOH水溶液與2.38％  THAM作業。\n4. 檢附測試報告及5％TMAH不滲透性測試報告。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(78, 'D', 'P-048-M', '酸鹼溶劑用PVC手套', 'P-048-M.png', '', '百潤', 'GSO-ST-01', 'M', '雙', '1. 長30公分，厚0.25 mm。\n2. 塑膠(PVC)材質，指尖加厚。\n3. 適用HCl、HF、NaOH水溶液與2.38％  THAM作業。\n4. 檢附測試報告及5％TMAH不滲透性測試報告。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(79, 'D', 'P-048-L', '酸鹼溶劑用PVC手套', 'P-048-L.png', '', '百潤', 'GSO-ST-01', 'L', '雙', '1. 長30公分，厚0.25 mm。\n2. 塑膠(PVC)材質，指尖加厚。\n3. 適用HCl、HF、NaOH水溶液與2.38％  THAM作業。\n4. 檢附測試報告及5％TMAH不滲透性測試報告。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(80, 'D', 'P-048-XL', '酸鹼溶劑用PVC手套', 'P-048-XL.png', '', '百潤', 'GSO-ST-01', 'XL', '雙', '1. 長30公分，厚0.25 mm。\n2. 塑膠(PVC)材質，指尖加厚。\n3. 適用HCl、HF、NaOH水溶液與2.38％  THAM作業。\n4. 檢附測試報告及5％TMAH不滲透性測試報告。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(81, 'B', 'P-049', '皮革圍裙', 'P-049.png', '', '不指定', '', '單尺寸', '件', '1. 使用豬面皮製成\r\n2. 尺寸：0.6 mm(厚)*93 cm(長)*68 cm(寬)。\r\n3. 可耐切割穿刺。\r\n4.可耐熱60度以上', 'R12041106PG0', '', '1.1', '1.5', 'On', '2023-10-26 10:24:00', '2023-07-05 15:02:00', '陳建良'),
(82, 'B', 'P-050', '防酸鹼圍裙', 'P-050.png', '', '不指定', '', '單一\n尺寸', '件', '1. 長100 CM * 寬 72 CM\n2. PVC材質製成。\n3. 不發塵材質。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(83, 'B', 'P-051', '美式防酸鹼長袍', 'P-051.png', '', '不指定', '', '單一\n尺寸', '件', '1. 防多種酸鹼化學品，耐化性強。(含手袖，袖口鬆緊)\n2. 黃色，長 110 cm。\n3. 背後綁帶式。\n4. PVC材質。\n5. 無塵室可使用(不發塵材質)。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(84, 'B', 'P-052', 'C級_防化學品噴濺長袍 ', 'P-052.png', '', '不指定', '', '單一\n尺寸', '件', '1. 車縫線不得外露，必須加強接合；需採超音波銲接縫合或外貼防水條之不得有滲入風險之防護措施；臉部及肢體部份需具鬆緊帶束口。\n2. 使用Tychem C材質製成，防化學品穿透、滲透必須經過EN368、EN369測試完成。\n3. 布料抗化能力：依據 ASTM F739測試標準，滲透時間可抵抗48% 氫氟酸、93% 硫酸、氫氧化鈉等化學品480分鐘以上。\n4. 長 125cm。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(85, 'B', 'P-053-XL', 'C級防護衣_Tychem 6000', 'P-053-XL.png', '', 'Dupont', 'Thchem 6000', 'XL', '件', '1. 材質：Tychem F (Tyvek與防護膜複合而成)\n2. 車縫處貼合膠條、拉鏈加蓋。\n3. 布料抗化能力：滲透時間可抵抗正己烷化學品480分鐘以上。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(86, 'B', 'P-053-2XL', 'C級防護衣_Tychem 6000', 'P-053-2XL.png', '', 'Dupont', 'Thchem 6000', '2XL', '件', '1. 材質：Tychem F (Tyvek與防護膜複合而成)\n2. 車縫處貼合膠條、拉鏈加蓋。\n3. 布料抗化能力：滲透時間可抵抗正己烷化學品480分鐘以上。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(87, 'B', 'P-054-XL', '連身式C級防護衣', 'P-054-XL.png', '', '不指定', '', 'XL', '件', '1. 車縫線不得外露，必須加強接合，需採超音波銲接縫合或外貼防水條之不得有滲入風險之防護措施；臉部及肢體部份需具鬆緊帶束口。\n2. 使用Tychen C材質製成，防化學品穿透、滲透必須經過EN368、EN369測試完成。\n3. 布料抗化能力：依據 ASTM F739測試標準，滲透時間可抵抗48% 氫氟酸、93% 硫酸、氫氧化鈉等化學品480分鐘以上。\n4. 一包一件。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(88, 'B', 'P-054-3XL', '連身式C級防護衣', 'P-054-3XL.png', '', '不指定', '', '3XL', '件', '1. 車縫線不得外露，必須加強接合，需採超音波銲接縫合或外貼防水條之不得有滲入風險之防護措施；臉部及肢體部份需具鬆緊帶束口。\r\n2. 使用Tychen C材質製成，防化學品穿透、滲透必須經過EN368、EN369測試完成。\r\n3. 布料抗化能力：依據 ASTM F739測試標準，滲透時間可抵抗48% 氫氟酸、93% 硫酸、氫氧化鈉等化學品480分鐘以上。\r\n4. 一包一件。', '', '', '1.1', '1.5', 'On', '2023-07-11 13:26:00', '2023-07-05 15:02:00', '陳建良'),
(89, 'B', 'P-073-XL', 'D級防護衣', 'P-073-XL.png', '', '不指定', '', 'XL', '件', '1. 使用Tyvek材質製成。\n2. 可有效防護有害粉塵(TYPE 5)及輕微液體潑濺(TYPE 6)，符合ISO/ASTM 檢測。\n3.符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-11 13:26:00', '2023-07-05 15:02:00', '陳建良'),
(90, 'D', 'P-055', 'C級防酸鹼袖套', 'P-055.png', '', '不指定', '', '單一\n尺寸', '雙', '1. 車縫線不得外露，必須加強接合，需採超音波銲接縫合或外貼防水條之不得有滲入風險之防護措施；臉部及肢體部份需具鬆緊帶束口。\n2. 使用Tychem C材質製成，防化學品穿透、滲透必須經過EN368、EN369測試完成。\n3. 布料抗化能力：依據 ASTM F739測試標準，滲透時間可抵抗48% 氫氟酸、93% 硫酸、氫氧化鈉等化學品480分鐘以上。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(91, 'F', 'P-056', 'C級防護腳套', 'P-056.png', '', '不指定', '', '單一\n尺寸', '雙', '1. 車縫線不得外露，必須加強接合，需採超音波銲接縫合或外貼防水條之不得有滲入風險之防護措施。；臉部及肢體部份需具鬆緊帶束口。\n2. 使用Tychem C材質製成，防化學品穿透、滲透必須經過EN368、EN369測試完成。\n3. 布料抗化能力：依據 ASTM F739測試標準，滲透時間可抵抗48% 氫氟酸、93% 硫酸、氫氧化鈉等化學品480分鐘以上。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(92, 'F', 'P-057-6', 'C級化學品防護鞋', 'P-057-6.png', '', '不指定', '', '6', '雙', '1. 鋼頭安全型(長筒)，鋼片鞋底。\n2. 靴身能耐一般酸鹼。\n3. 符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(93, 'F', 'P-057-7', 'C級化學品防護鞋', 'P-057-7.png', '', '不指定', '', '7', '雙', '1. 鋼頭安全型(長筒)，鋼片鞋底。\n2. 靴身能耐一般酸鹼。\n3. 符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(94, 'F', 'P-057-8', 'C級化學品防護鞋', 'P-057-8.png', '', '不指定', '', '8', '雙', '1. 鋼頭安全型(長筒)，鋼片鞋底。\n2. 靴身能耐一般酸鹼。\n3. 符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(95, 'F', 'P-057-9', 'C級化學品防護鞋', 'P-057-9.png', '', '不指定', '', '9', '雙', '1. 鋼頭安全型(長筒)，鋼片鞋底。\n2. 靴身能耐一般酸鹼。\n3. 符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(96, 'F', 'P-057-10', 'C級化學品防護鞋', 'P-057-10.png', '', '不指定', '', '10', '雙', '1. 鋼頭安全型(長筒)，鋼片鞋底。\n2. 靴身能耐一般酸鹼。\n3. 符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(97, 'F', 'P-057-11', 'C級化學品防護鞋', 'P-057-11.png', '', '不指定', '', '11', '雙', '1. 鋼頭安全型(長筒)，鋼片鞋底。\n2. 靴身能耐一般酸鹼。\n3. 符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(98, 'F', 'P-057-12', 'C級化學品防護鞋', 'P-057-12.png', '', '不指定', '', '12', '雙', '1. 鋼頭安全型(長筒)，鋼片鞋底。\n2. 靴身能耐一般酸鹼。\n3. 符合EN/ANSI/CNS/CE認證。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(99, 'F', 'P-058-68', '皮鞋款安全鞋', 'P-058-68.png', '', '不指定', '', '68', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(100, 'F', 'P-058-70', '皮鞋款安全鞋', 'P-058-70.png', '', '不指定', '', '70', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(101, 'F', 'P-058-72', '皮鞋款安全鞋', 'P-058-72.png', '', '不指定', '', '72', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(102, 'F', 'P-058-74', '皮鞋款安全鞋', 'P-058-74.png', '', '不指定', '', '74', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(103, 'F', 'P-058-76', '皮鞋款安全鞋', 'P-058-76.png', '', '不指定', '', '76', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(104, 'F', 'P-058-78', '皮鞋款安全鞋', 'P-058-78.png', '', '不指定', '', '78', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(105, 'F', 'P-058-80', '皮鞋款安全鞋', 'P-058-80.png', '', '不指定', '', '80', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(106, 'F', 'P-058-82', '皮鞋款安全鞋', 'P-058-82.png', '', '不指定', '', '82', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(107, 'F', 'P-058-84', '皮鞋款安全鞋', 'P-058-84.png', '', '不指定', '', '84', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(108, 'F', 'P-058-86', '皮鞋款安全鞋', 'P-058-86.png', '', '不指定', '', '86', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(109, 'F', 'P-058-88', '皮鞋款安全鞋', 'P-058-88.png', '', '不指定', '', '88', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(110, 'F', 'P-058-90', '皮鞋款安全鞋', 'P-058-90.png', '', '不指定', '', '90', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(111, 'F', 'P-058-92', '皮鞋款安全鞋', 'P-058-92.png', '', '不指定', '', '92', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(112, 'F', 'P-058-94', '皮鞋款安全鞋', 'P-058-94.png', '', '不指定', '', '94', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(113, 'F', 'P-059-68', '運動款安全鞋', 'P-059-68.png', '', '不指定', '', '68', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(114, 'F', 'P-059-70', '運動款安全鞋', 'P-059-70.png', '', '不指定', '', '70', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(115, 'F', 'P-059-72', '運動款安全鞋', 'P-059-72.png', '', '不指定', '', '72', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(116, 'F', 'P-059-74', '運動款安全鞋', 'P-059-74.png', '', '不指定', '', '74', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(117, 'F', 'P-059-76', '運動款安全鞋', 'P-059-76.png', '', '不指定', '', '76', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(118, 'F', 'P-059-78', '運動款安全鞋', 'P-059-78.png', '', '不指定', '', '78', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(119, 'F', 'P-059-80', '運動款安全鞋', 'P-059-80.png', '', '不指定', '', '80', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(120, 'F', 'P-059-82', '運動款安全鞋', 'P-059-82.png', '', '不指定', '', '82', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(121, 'F', 'P-059-84', '運動款安全鞋', 'P-059-84.png', '', '不指定', '', '84', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(122, 'F', 'P-059-86', '運動款安全鞋', 'P-059-86.png', '', '不指定', '', '86', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(123, 'F', 'P-059-88', '運動款安全鞋', 'P-059-88.png', '', '不指定', '', '88', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(124, 'F', 'P-059-90', '運動款安全鞋', 'P-059-90.png', '', '不指定', '', '90', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(125, 'F', 'P-059-92', '運動款安全鞋', 'P-059-92.png', '', '不指定', '', '92', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(126, 'F', 'P-059-94', '運動款安全鞋', 'P-059-94.png', '', '不指定', '', '94', '雙', '1. 符合CNS20345測試標準\n2. 鋼頭需抗壓扁、耐衝擊性佳、具抗靜電功能\n3. 鞋底防穿刺鋼板採用不銹鋼材質', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(127, 'H', 'P-060', '堵漏處理條', 'P-060.png', '', '不指定', '', '', '條', '耐腐蝕塑鋼材質，每條長度：17 cm(7\")。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(128, 'H', 'P-061', 'pH試紙', 'P-061.png', '', '不指定', '', '', '盒', '1. 200片/盒\n2. 可於酸/鹼液測定質(pH 1.0 ~ 11.0)。\n3. 以顏色顯示測定質：紅色為酸，藍色為鹼。\n4. 出廠日期一年內，且外盒需標示有效日期。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(129, 'H', 'P-062', '化學品專用吸液棉片', 'P-062.png', '', '', '', '', '箱', '1. 需採用超細纖維材質，減少發塵狀況，並加厚處理增加吸液量。\n2. 100片/箱，25*38 cm。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(130, 'H', 'P-063', '化學品專用吸液棉條', 'P-063.png', '', '', '', '', '箱', '1. 表面需採用SMS複合材質，減少發塵狀況\n2. 12條/箱，吸液量12 Gal/箱，尺寸：7*10 cm(3\"*4\")。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(131, 'H', 'P-064', '化學品專用吸液棉枕', 'P-064.png', '', '', '', '', '箱', '1. 表面需採用SMS複合材質，減少發塵狀況\n2. 10-16個/箱，吸液量11 Gal/箱，尺寸：17*38 cm(7\"*15\")。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(132, 'H', 'P-065-S', '廢棄物處理袋_小型', 'P-065-S.png', '', '不指定', '', 'S', '個', '1. 黃色，HDPE材質。\n2. 需附一體成形綁帶(非獨立束帶)。\n3. 尺寸：55 cm * 45 cm 。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(133, 'H', 'P-065-M', '廢棄物處理袋_中型', 'P-065-M.png', '', '不指定', '', 'M', '個', '1. 黃色，HDPE材質。\n2. 需附一體成形綁帶(非獨立束帶)。\n3. 尺寸：90 cm *75 cm 。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(134, 'H', 'P-065-L', '廢棄物處理袋_大型', 'P-065-L.png', '', '不指定', '', 'L', '個', '1. 黃色，HDPE材質。\n2. 需附一體成形綁帶(非獨立束帶)。\n3. 尺寸：130 cm * 90cm 。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(135, 'I', 'P-066', '差速防墜器', 'P-066.png', '', '不指定', '', '', '組', '1. 通過ANSI/CE標準認證。\n2. 織帶長度1.8 m。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(136, 'B', 'P-067-A', '全身式安全帶', 'P-067-A.png', '', '不指定', '', '', '件', '1. 符合CNS14253-1~6規範，掛繩強度達1830 KGF不得破斷。\n2. 衝擊吸收性及強度第一次衝擊力不得超過900 KGF，且符合重複兩次不得斷裂。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(137, 'B', 'P-067-B', '全身式安全帶_加大型', 'P-067-B.png', '加大型', '不指定', '', '3XL\n以上', '件', '1. 符合CNS14253-1~6規範，掛繩強度達1830 KGF不得破斷。\n2. 衝擊吸收性及強度第一次衝擊力不得超過900 KGF，且符合重複兩次不得斷裂。', '', '', '1.1', '1.5', 'Off', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(138, 'I', 'P-068', '雙大鉤連接繩', 'P-068.png', '', '不指定', '', '', '件', '1. 符合CNS14253-1~6規範，掛繩強度達1830 KGF不得破斷，並需附有減振包。\n2. 衝擊吸收性及強度第一次衝擊力不得超過900 KGF，且符合重複兩次不得斷裂。', '', '', '1.1', '1.5', 'Off', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(139, 'H', 'P-069', '警示帶', 'P-069.png', '', '不指定', '', '', '個', '1. 黃底紅字，尺寸：20 cm *150 m。\n2. 印刷禁止靠近或施工危險請勿靠近。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(140, 'H', 'P-070-A', '警示角錐', 'P-070-A.png', '', '不指定', '', '', '個', '橘紅色角椎', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(141, 'H', 'P-070-B', '警示角錐(含群創光電字樣)', 'P-070-B.png', '', '不指定', '', '', '個', '橘紅色角椎(含群創光電字樣)', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(142, 'H', 'P-071', '伸縮連桿', 'P-071.png', '', '不指定', '', '', '個', '具伸縮功能達2 m\n黃黑相間', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(143, 'H', 'P-074-A', '伸縮連桿接頭_4.0cm', 'P-074-A.png', '', '不指定', '', '4.0cm', '個', '1. 需配合現有伸縮連桿。\n2. 扣環端直徑4.0 cm。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良'),
(144, 'H', 'P-074-B', '伸縮連桿接頭_4.5cm', 'P-074-B.png', '', '不指定', '', '4.5cm', '個', '1. 需配合現有伸縮連桿。\n2. 扣環端直徑4.5 cm。', '', '', '1.1', '1.5', 'On', '2023-07-06 11:43:00', '2023-07-05 15:02:00', '陳建良');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `_cata`
--
ALTER TABLE `_cata`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `SN` (`SN`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `_cata`
--
ALTER TABLE `_cata`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'ai', AUTO_INCREMENT=145;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
