-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-01-25 09:55:26
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `ppe`
--

-- --------------------------------------------------------

--
-- 資料表結構 `pt_local`
--

CREATE TABLE `pt_local` (
  `id` int(10) UNSIGNED NOT NULL COMMENT 'ai',
  `fab_id` int(10) UNSIGNED NOT NULL COMMENT '歸屬Fab',
  `local_title` varchar(50) NOT NULL COMMENT '子區域名稱',
  `local_remark` varchar(255) NOT NULL COMMENT '子區域註解',
  `low_level` longtext DEFAULT NULL COMMENT '安全水位',
  `flag` varchar(5) NOT NULL COMMENT '開關',
  `created_at` datetime NOT NULL COMMENT '創建時間',
  `updated_at` datetime NOT NULL COMMENT '更新時間',
  `updated_user` varchar(10) NOT NULL COMMENT '建檔人員'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `pt_local`
--

INSERT INTO `pt_local` (`id`, `fab_id`, `local_title`, `local_remark`, `low_level`, `flag`, `created_at`, `updated_at`, `updated_user`) VALUES
(1, 5, '四樓 CF T-43柱位', '沖身洗眼器', NULL, 'On', '2024-01-22 15:35:00', '2024-01-22 15:35:00', '陳建良'),
(2, 5, '四樓 CF B-59柱位', '沖身洗眼器', NULL, 'On', '2024-01-22 15:35:00', '2024-01-22 15:35:00', '陳建良'),
(3, 5, '四樓 CF B-39柱位', '沖身洗眼器', NULL, 'On', '2024-01-22 15:35:00', '2024-01-22 15:56:00', '陳建良'),
(4, 5, '四樓 CF 管制口', 'CF 管制口', NULL, 'On', '2024-01-22 15:36:00', '2024-01-22 15:36:00', '陳建良'),
(5, 5, '一樓 健康中心', '健康中心', '{\"PT-901-LIS\":\"10\",\"PT-901-MIC\":\"10\",\"PT-902-LPM\":\"0\",\"PT-902-DAP\":\"0\",\"PT-903\":\"0\"}', 'On', '2024-01-22 15:37:00', '2024-01-24 11:03:00', '陳建良'),
(6, 5, 'CUB B1F TMAH中繼站桶槽', '回收中繼站', NULL, 'On', '2024-01-22 15:37:00', '2024-01-22 15:37:00', '陳建良'),
(7, 5, '二樓 Array 管制口', 'Array 管制口', NULL, 'On', '2024-01-22 15:38:00', '2024-01-22 15:38:00', '陳建良'),
(8, 5, '一樓 Array M-37柱位', '沖身洗眼器', NULL, 'On', '2024-01-22 15:38:00', '2024-01-22 15:38:00', '陳建良'),
(9, 5, '一樓 Array M-27柱位', '沖身洗眼器', NULL, 'On', '2024-01-22 15:39:00', '2024-01-22 15:39:00', '陳建良'),
(10, 5, 'CUB二樓 廠務辦公室', '廠務辦公室', NULL, 'On', '2024-01-22 15:39:00', '2024-01-22 15:39:00', '陳建良'),
(11, 11, '1F 健康中心', '健康中心', '{\"PT-901-LIS\":\"1\",\"PT-901-MIC\":\"1\",\"PT-902-LPM\":\"1\",\"PT-902-DAP\":\"0\",\"PT-903\":\"0\"}', 'On', '2024-01-23 14:05:00', '2024-01-24 11:10:00', '陳建良'),
(12, 11, '1F 檢測中心', '檢測中心', NULL, 'On', '2024-01-23 14:06:00', '2024-01-23 14:06:00', '陳建良'),
(13, 2, '二樓 Array管制口', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(14, 2, '廠務Utility三樓 B6柱位之TMAH機台', 'TMAH機台', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(15, 2, '一樓 B13氣化課化學房', '化學房', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(16, 2, '三樓 CF管制口', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(17, 2, '三樓 CF BB-4柱位之TMAH機台', 'TMAH機台', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(18, 2, '一樓 健康中心', '健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(19, 2, 'RD三樓 Z-8柱位', 'RD三樓', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(20, 3, '廢水處理廠', '3F實驗室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(21, 3, '氣化課值班室', '值班室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(22, 3, '四樓 CF管制口', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(23, 3, '四樓 CF CNVR01 (25%TMAH tank)', 'CF CNVR01', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(24, 3, '四樓 CF CNVR06 (25%TMAH tank)', 'CF CNVR06', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(25, 3, '四樓 CF CNVR07 (25%TMAH tank)', 'CF CNVR07', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(26, 3, '一樓 防災中心', '防災中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(27, 3, '二樓 Array管制口', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(28, 3, '一樓 無塵室25%TMAH tank E8柱位', 'TMAH tank旁', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(29, 3, '一樓 健康中心', '健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(30, 4, 'Array 1F 無塵室 M-29柱 25%TMAH tank旁', 'Array TMAH tank旁', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(31, 4, 'Array 1F 無塵室 H-33柱 25%TMAH tank旁', 'Array TMAH tank旁', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(32, 4, 'Array 2F 管制口 (現場作業備用)', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(33, 4, 'CF 4F 管制口 (現場作業備用)', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(34, 4, 'CF 4F 無塵室 H-3柱 緊急沖身洗眼器旁', '沖身洗眼器', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(35, 4, 'CF 4F 無塵室 B-42柱 25%TMAH供液槽房外', 'TMAH供液槽房外', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(36, 4, 'CF 2F 無塵室 sC-24柱 緊急沖身洗眼器旁', '沖身洗眼器', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(37, 4, 'CUB B1F 水務課純水槽區', '純水槽區', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(38, 4, 'CUB 1F 氣化課化學房 (25%TMAH)', 'TMAH tank旁', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(39, 4, 'CUB 2F 廠務值班室', '廠務值班室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(40, 4, 'Office 1F 健康中心', '健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(41, 6, '三樓 CF管制口', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(42, 6, 'CUB化學房 (3F)) [For 25%TMAH]', '3F TMAH tank', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(43, 6, '廠務值班室', '廠務值班室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(44, 6, 'CUB化學房 (1F)) [For 25%TMAH]', '1F TMAH tank', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(45, 6, '廠務廢水處理廠', '廢水廠', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(46, 6, '一樓 Array G14.5柱位DVRC', 'DVRC', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(47, 6, '二樓 Array管制口', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(48, 6, '一樓 健康中心', '健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(49, 7, 'CUB 1F 廠務值班室', '廠務值班室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(50, 7, 'CUB 1F A39 酸鹼房', '酸鹼房', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(51, 7, 'CUB L03 D21TMAH防護櫃', 'TMAH防護櫃', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(52, 7, 'CUB L40 C09 鹼液加藥區 (原A07)', '鹼液加藥區', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(53, 7, 'CUB L03 C33柱 TMAH回收系統使用', 'TMAH回收系統', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(54, 7, 'B1樓 健康中心', '健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(55, 7, '四樓 CF管制口', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(56, 7, '二樓 Array管制口', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(57, 7, 'CUB 1F 防災中心', '防災中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(58, 8, '廠務氣化值班室', '氣化', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(59, 8, '廠務水務值班室', '水務', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(60, 8, '廠務總值班室', '總值班', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(61, 8, '健康中心', '健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(62, 8, 'Array管制口', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(63, 8, 'Array管制口', 'Array管制口-FAB 內', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(64, 8, '防災中心', '防災中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(65, 8, 'CF管制口', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(66, 8, 'CF無塵室K05柱位', 'K05柱位', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(67, 8, 'CF無塵室C01柱位', 'C01柱位', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(68, 8, 'CF無塵室H47柱位', 'H47柱位', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(69, 9, '廠務洩漏處理台車、化學房 (G/C，G/Y)', '洩漏處理台車', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(70, 9, '廢水處理廠2F控制室 (水務)', '2F控制室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(71, 9, '一樓 健康中心', '健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(72, 9, '二樓 Array管制口', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(73, 9, '六樓 CF管制口', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(74, 9, '八樓 LCD管制口', 'LCD管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(75, 9, 'CUB一樓 防災中心', '防災中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(76, 13, '廠務管道間充身洗眼器', '沖身洗眼器', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(77, 13, '化學房之沖身洗眼器', '沖身洗眼器', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(78, 13, '廢水處理廠控制室', '控制室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(79, 13, 'Array管制口', 'Array管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(80, 13, '六樓 CELL & CF管制口', 'CF管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(81, 13, '一樓 T6整合實驗室', '實驗室', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(82, 13, '健康中心', 'OFFICE棟', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(83, 13, '防災中心', 'CUB棟', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(84, 10, 'B棟2F管制口', '2F管制口', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(85, 10, 'B棟健康中心', 'B棟2F健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(86, 10, 'A棟健康中心 ', 'A棟1F健康中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(87, 10, 'S2柱位之沖身洗眼器', '沖身洗眼器', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(88, 10, 'Q3柱位之沖身洗眼器', '沖身洗眼器', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(89, 10, 'AB棟交界_500T廢水廠', '500T廢水廠', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(90, 10, '東側化學房', '鹼房', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(91, 10, 'HF供酸區', '供酸區', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(92, 10, 'HF回收區', 'B棟B1F回收區', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(93, 10, 'HF廢液槽車充填區', '槽車充填區', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良'),
(94, 10, '防災中心', '防災中心', NULL, 'On', '2024-01-24 10:15:00', '2024-01-24 10:15:00', '陳建良');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `pt_local`
--
ALTER TABLE `pt_local`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `pt_local`
--
ALTER TABLE `pt_local`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT 'ai', AUTO_INCREMENT=95;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
